Repository: kcahit/ArchiX
Catalog: src/ArchiX.Library/Resources/PasswordValidation.*.resx
Languages: tr_tr

# EMPTY
source: Password cannot be empty.
tr_tr: Parola boş olamaz.

# MIN_LENGTH
source: Password must be at least {0} characters long.
tr_tr: Parola en az {0} karakter olmalıdır.

# MAX_LENGTH
source: Password must be at most {0} characters long.
tr_tr: Parola en fazla {0} karakter olmalıdır.

# REQ_UPPER
source: Password must contain at least one uppercase letter.
tr_tr: Parola en az bir büyük harf içermelidir.

# REQ_LOWER
source: Password must contain at least one lowercase letter.
tr_tr: Parola en az bir küçük harf içermelidir.

# REQ_DIGIT
source: Password must contain at least one digit.
tr_tr: Parola en az bir rakam içermelidir.

# REQ_SYMBOL
source: Password must contain at least one special character.
tr_tr: Parola en az bir özel karakter içermelidir.

# MIN_DISTINCT
source: Password must contain at least {0} distinct characters.
tr_tr: Parola en az {0} farklı karakter içermelidir.

# REPEAT_SEQ
source: Password can contain at most {0} repeated characters.
tr_tr: Parola en fazla {0} kez tekrarlanan karakter içerebilir.

# BLOCK_LIST
source: This password is in the blocked words list.
tr_tr: Bu parola yasaklı kelimeler listesinde bulunuyor.

# BLACKLIST
source: This password contains blacklisted words.
tr_tr: Bu parola yasaklanmış kelimeler içeriyor.

# DYNAMIC_BLOCK
source: This password is in the dynamic block list.
tr_tr: Bu parola dinamik engelleme listesinde bulunuyor.

# EXPIRED
source: Your password has expired. Please set a new password.
tr_tr: Parolanızın süresi dolmuştur. Lütfen yeni bir parola belirleyin.

# PWNED
source: This password has been found in data breaches. Please choose a different password.
tr_tr: Bu parola daha önce veri sızıntılarında tespit edilmiş. Lütfen farklı bir parola seçin.

# HISTORY
source: You have used this password before. Please choose a different password.
tr_tr: Bu parolayı daha önce kullandınız. Lütfen farklı bir parola seçin.

# DICTIONARY_WORD
source: This password is a commonly used word. Please choose a more secure password.
tr_tr: Bu parola çok yaygın kullanılan bir kelime. Lütfen daha güvenli bir parola seçin.

# LOW_ENTROPY
source: Password is not complex enough. Please choose a stronger password.
tr_tr: Parola yeterince karmaşık değil. Lütfen daha güçlü bir parola seçin.
